brew "ack"
brew "agda"
brew "ansible"
brew "ansible-lint"
brew "ansiweather"
brew "apache-spark"
brew "artifactory"
brew "ask-cli"
brew "automake"
brew "autopep8"
brew "awk"
brew "aws-cdk"
brew "aws-cfn-tools"
brew "aws/tap/aws-sam-cli"
brew "aws-shell"
brew "awscli"
brew "awslogs"
brew "babel"
brew "bash-completion@2"
brew "bats"
brew "binutils"
brew "bison"
brew "black"
brew "bower"
brew "brew-cask-completion"
brew "cabal-install"
brew "calcurse"
brew "cask"
brew "chicken"
brew "chrome-cli"
brew "circleci"
brew "clang-format"
brew "cless"
brew "clockywock"
brew "clojure"
brew "clojure-lsp"
brew "cloud-watch"
brew "cmake"
brew "codequery"
brew "coffeescript"
brew "coq"
brew "coreutils"
brew "curl"
brew "curl-openssl"
brew "cython"
brew "dbus"
brew "deno"
brew "diff-pdf"
brew "diff-so-fancy"
brew "docker"
brew "docker-clean"
brew "dpkg"
brew "dungeon"
brew "elixir"
brew "elasticsearch"
brew "emojify"
brew "eprover" # Theorem prover for full first-order logic with equality
brew "euler-py" # Project Euler command-line tool written in Python
brew "fasttext" # Library for fast text representation and classification
brew "feh" # X11 image viewer
brew "fetchmail" # Fetch mail from a POP, IMAP, ETRN, or ODMR-capable server
brew "ffmpeg" # Play, record, convert, and stream audio and video
brew "firebase-cli" # Firebase command-line tools
brew "flex" # Fast Lexical Analyzer, generates Scanners (tokenizers)
brew "fortune" # fortune cookies
brew "frugal" # Cross language code generator for creating scalable microservices
brew "fswatch" # Monitor a directory for changes and run a shell command
brew "galen" # Automated testing of look and feel for responsive websites
brew "gambit" # Software tools for game theory
brew "gatsby-cli"
brew "gaul" # Genetic Algorithm Utility Library
brew "gcc"
brew "gdb"
brew "hugo"
brew "kibana"
brew "neovim"
brew "node"
brew "nvm"
brew "zsh"
brew "zsh-completions"
