# casks
cask_args appdir: '/Applications'
cask "alacritty"
cask "adoptopenjdk"

tap "aws/tap"
brew "aws-sam-cli"

brew "wifi-password"
brew "zsh-git-prompt"
brew "zsh-lovers"
brew "zsh-navigation-tools"
brew "zsh-syntax-highlighting"
brew "zzz" # Command-line tool to put Macs to sleep
brew "tree" # Display directories as trees (with optional color/HTML output)
brew "w3m"
brew "readosm" # Extract valid data from an Open Street Map input file
brew "redis"
brew "redpen" # Proofreading tool to help writers of technical documentation
brew "redshift" # Adjust color temperature of your screen according to your surroundings
brew "remarshal" # Convert between TOML, YAML and JSON
brew "remind" # Sophisticated calendar and alarm
brew "resty" # Command-line REST client that can be used in pipelines
brew "riemann" # Event stream processor
brew "rkhunter" # Rootkit hunter
brew "robodoc" # Source code documentation tool
brew "rolldice"
brew "roundup" # Unit testing tool
brew "rtv" # Command-line Reddit client
brew "sceptre" # Build better AWS infrastructure
brew "sendemail" # Email program for sending SMTP mail
brew "shellcheck" # Static analysis and lint tool, for (ba)sh scripts
brew "presto" # Distributed SQL query engine for big data
brew "shogun" # Large scale machine learning toolbox
brew "shpotify" # Command-line interface for Spotify on a Mac
brew "snakemake" # Pythonic workflow system
brew "snag" # Automatic build tool for all your needs
brew "sshrc" # Bring your .bashrc, .vimrc, etc. with you when you SSH
brew "starship" # The cross-shell prompt for astronauts
brew "r"
brew "pre-commit" # Framework for managing multi-language pre-commit hooks
brew "postgresql"
brew "pokerstove" # Poker evaluation and enumeration software
brew "mahout" # Library to help build scalable machine learning libraries
brew "make"
brew "mailutils" # Swiss Army knife of email handling
brew "mallet" # MAchine Learning for LanguagE Toolkit
brew "man-db" # Unix documentation system
brew "mandoc" # The mandoc UNIX manpage compiler toolset
brew "mdp" # Command-line based markdown presentation tool
brew "mdr" # Make diffs readable
brew "lynx"
brew "lsd"
brew "logstash"
brew "loc"
brew "llvm"
brew "ack"
brew "ansible"
brew "ansible-lint"
brew "ansiweather"
brew "apache-spark"
brew "artifactory"
brew "ask-cli"
brew "automake"
brew "awk"
brew "aws-cfn-tools"
brew "aws-shell"
brew "awscli"
brew "awslogs"
brew "babel"
brew "bash-completion@2"
brew "bats"
brew "binutils"
brew "bison"
brew "black"
brew "bower"
brew "brew-cask-completion"
brew "cabal-install"
brew "calcurse"
brew "cask"
brew "chrome-cli"
brew "circleci"
brew "clang-format"
brew "cless"
brew "clockywock"
brew "cloud-watch"
brew "cmake"
brew "codequery"
brew "coreutils"
brew "curl"
brew "curl-openssl"
brew "cython"
brew "dbus"
brew "deno"
brew "diff-pdf"
brew "diff-so-fancy"
brew "docker"
brew "docker-clean"
brew "dpkg"
brew "elixir"
brew "elasticsearch"
brew "emojify"
brew "euler-py" # Project Euler command-line tool written in Python
brew "fasttext" # Library for fast text representation and classification
brew "feh" # X11 image viewer
brew "fetchmail" # Fetch mail from a POP, IMAP, ETRN, or ODMR-capable server
brew "ffmpeg" # Play, record, convert, and stream audio and video
brew "flex" # Fast Lexical Analyzer, generates Scanners (tokenizers)
brew "fortune" # fortune cookies
brew "frugal" # Cross language code generator for creating scalable microservices
brew "fswatch" # Monitor a directory for changes and run a shell command
brew "galen" # Automated testing of look and feel for responsive websites
brew "gambit" # Software tools for game theory
brew "gatsby-cli"
brew "gaul" # Genetic Algorithm Utility Library
brew "gcal" # Program for calculating and printing calendars
brew "gcc"
brew "gdb"
brew "gdrive" # Google Drive CLI Client
brew "gearboy" # Nintendo Game Boy (Color) emulator
brew "gearsystem" # Sega Master System / Game Gear / SG-1000 emulator
brew "getmail" # Extensible mail retrieval system with POP3, IMAP4, SSL support
brew "ghi" # Work on GitHub issues on the command-line
brew "gist" # Command-line utility for uploading Gists
brew "gistit" # Command-line utility for creating Gists
brew "git"
brew "git-appraise" # Distributed code review system for Git repos
brew "git-delta" # Syntax-highlighting pager for git
brew "git-extras" # Small git utilities
brew "git-flow"
brew "git-fresh" # Utility to keep git repos fresh
brew "git-game" # Game for git to guess who made which commit
brew "git-lfs"
brew "git-now" # Light, temporary commits for git
brew "git-octopus" # The continuous merge workflow
brew "git-open" # Open GitHub webpages from a terminal
brew "git-secrets" # Prevents you from committing sensitive information to a git repo
brew "git-standup" # Git extension to generate reports for standup meetings
brew "git-utils" # Various Git helper utilities
brew "giter8" # Generate files and directories from templates in a git repo
brew "github-markdown-toc" # Easy TOC creation for GitHub README.md (in go)
brew "gitmoji" # Emoji guide for your commit messages
brew "gitversion" # Easy semantic versioning for projects using Git
brew "glances" # Alternative to top/htop
brew "glide" # Simplified Go project management, dependency management, and vendoring
brew "globe" # Prints ASCII graphic of currently-lit side of the Earth
brew "gnu-complexity" # Measures complexity of C source
brew "go-jira" # Simple jira command-line client in Go
brew "goad" # AWS Lambda powered, highly distributed, load testing tool built in Go
brew "gomplate" # Command-line Golang template processor
brew "goofys" # Filey-System interface to Amazon S3
brew "googler" # Google Search and News from the command-line
brew "gotags" # Tag generator for Go, compatible with ctags
brew "gotags" # Go cross compile tool
brew "grafana" # Gorgeous metric visualizations and dashboards for timeseries databases
brew "graph-tool" # Efficient network analysis for Python 3
brew "greed" # Game of consumption
brew "grip" # GitHub Markdown previewer
brew "gron" # Make JSON greppable
brew "hdf5" # File format designed to store large amounts of data
brew "help2man" # Automatically generate simple man pages
brew "hugo"
brew "kibana"
brew "neovim"
brew "node"
brew "nvm"
brew "zsh"
brew "zsh-completions"
brew "hivemind" # The mind to rule processes of your development environment
brew "hledger" # Command-line accounting tool
brew "hub" # Add GitHub support to git on the command-line
brew "hubflow" # GitFlow for GitHub
brew "hyperfine" # Command-line benchmarking tool
brew "hyperscan" # High-performance regular expression matching library
brew "icdiff" # Improved colored diff
brew "ii" # Minimalist IRC client
brew "imessage-ruby" # Command-line tool to send iMessage"
brew "immortal" # OS agnostic (*nix) cross-platform supervisor
brew "iniparser" # Library for parsing ini files
brew "ipbt" # Program for recording a UNIX terminal session
brew "iso-codes" # Provides lists of various ISO standards
brew "ivy" # Agile dependency manager
brew "juju" # DevOps management tool
brew "juju-wait" # Juju plugin for waiting for deployments to settle
brew "jump" # Helps you navigate your file system faster by learning your habits
brew "just" # Handy way to save and run project-specific commands
brew "k6" # Modern load testing tool, using Go and JavaScript
brew "khal" # CLI calendar application
brew "kqwait" # Wait for events on files or directories on macOS
brew "kyua" # Testing framework for infrastructure software
brew "launch" # Command-line launcher for macOS, in the spirit of `open`
brew "lci" # Interpreter for the lambda calculus
brew "ledger" # Command-line, double-entry accounting tool
brew "miller" # Like sed, awk, cut, join & sort for name-indexed data such as CSV
brew "mockserver" # Mock HTTP server and proxy
brew "modd" # Flexible tool for responding to filesystem changes
brew "nagios" # Network monitoring and management system
brew "nagios-plugins" # Plugins for the nagios network monitoring system
brew "naturaldocs" # Extensible, multi-language documentation generator
brew "ncmpcpp" # Ncurses-based client for the Music Player Daemon
brew "neofetch" # Fast, highly customisable system info script
brew "newman" # Command-line collection runner for Postman
brew "nload" # Realtime console network usage monitor
brew "noti" # Trigger notifications when a process completes
brew "notifiers" # The easy way to send notifications
brew "nq" # Unix command-line queue utility
brew "terraform"
brew "terraform-docs" # CLI tool to generate terraform files from existing infrastructure
brew "terraforming" # Export existing AWS resources to Terraform style (tf, tfstate)
brew "terrahub" # Terraform automation and orchestration tool
brew "tflint" # terraform lint
brew "tesseract"
brew "tesseract-lang"


## terminal/shell
brew "nushell"
brew "terminator"
brew "termrec" # Record videos of terminal output

### documentation
brew "tealdeer"

### rss
brew "newsboat"

### email
brew "mutt"
brew "notmuch" # Thread-based email index, search, and tagging
brew "opencv"
brew "osxutils" # Collection of macOS command-line utilities
brew "pandoc"
brew "parallel"
brew "parquet-tools" # Apache Parquet command-line tools and utilities

### pdfs
brew "pdf-redact-tools"
brew "pdf2htmlex"
brew "pdf2image"
brew "pdf2json"
brew "pdfgrep"

### docker
brew "lazydocker" # The lazier way to manage everything docker

### images/video/sound
brew "leptonica"
brew "imagemagick"
brew "moc" # Terminal-based music player
brew "mpc" # Command-line music player client for mpd
brew "mpd" # Music Player Daemon
brew "mps-youtube" # Terminal based YouTube player and downloader

### git/GitHub
brew "kommit" # More detailed commit messages without committing!
brew "lazygit" # Simple terminal UI for git commands
brew "legit" # Command-line interface for Git, optimized for workflow simplicity
brew "lf" # Terminal file manager
brew "libev" # Asynchronous event library
brew "libevent" # Asynchronous event library

### Statistics/Algorithms
brew "jags" # Just Another Gibbs Sampler for Bayesian MCMC simulation
brew "lapack" # Linear Algebra PACKage
brew "openblas"

### JSON
brew "jq"
brew "jsawk" # Like awk, but for JSON, using JavaScript objects and arrays
brew "jsonlint"
brew "jsonnet"

### TO-DO/NOTES
brew "joplin" # Note taking and to-do application with synchronisation capabilities
brew "jrnl" # Command-line note taker
brew "task" # Feature-rich console based todo list manager
brew "task-spooler" # Batch system to run tasks one after another
brew "taskd" # Client-server synchronization for todo lists
brew "taskell" # Command-line Kanban board/task manager with support for Trello
brew "timewarrior" # Command-line time tracking application
brew "todo-txt" # Minimal, todo.txt-focused editor
brew "tnote" # Small note-taking program for the terminal
brew "todoman" # Simple CalDAV-based todo manager
brew "when" # Tiny personal calendar
