brew "ack"
brew "agda"
brew "ansible"
brew "ansible-lint"
brew "ansiweather"
brew "apache-spark"
brew "artifactory"
brew "ask-cli"
brew "automake"
brew "autopep8"
brew "awk"
brew "aws-cdk"
brew "aws-cfn-tools"
brew "aws/tap/aws-sam-cli"
brew "aws-shell"
brew "awscli"
brew "awslogs"
brew "babel"
brew "bash-completion@2"
brew "bats"
brew "binutils"
brew "bison"
brew "black"
brew "bower"
brew "brew-cask-completion"
brew "cabal-install"
brew "calcurse"
brew "cask"
brew "chicken"
brew "chrome-cli"
brew "circleci"
brew "clang-format"
brew "cless"
brew "clockywock"
brew "clojure"
brew "clojure-lsp"
brew "cloud-watch"
brew "cmake"
brew "codequery"
brew "coffeescript"
brew "coq"
brew "coreutils"
brew "curl"
brew "curl-openssl"
brew "cython"
brew "dbus"
brew "deno"
brew "diff-pdf"
brew "diff-so-fancy"
brew "docker"
brew "docker-clean"
brew "dpkg"
brew "dungeon"
brew "elixir"
brew "elasticsearch"
brew "emojify"
brew "eprover" # Theorem prover for full first-order logic with equality
brew "euler-py" # Project Euler command-line tool written in Python
brew "fasttext" # Library for fast text representation and classification
brew "feh" # X11 image viewer
brew "fetchmail" # Fetch mail from a POP, IMAP, ETRN, or ODMR-capable server
brew "ffmpeg" # Play, record, convert, and stream audio and video
brew "firebase-cli" # Firebase command-line tools
brew "flex" # Fast Lexical Analyzer, generates Scanners (tokenizers)
brew "fortune" # fortune cookies
brew "frugal" # Cross language code generator for creating scalable microservices
brew "fswatch" # Monitor a directory for changes and run a shell command
brew "galen" # Automated testing of look and feel for responsive websites
brew "gambit" # Software tools for game theory
brew "gatsby-cli"
brew "gaul" # Genetic Algorithm Utility Library
brew "gcal" # Program for calculating and printing calendars
brew "gcc"
brew "gdb"
brew "gdrive" # Google Drive CLI Client
brew "gearboy" # Nintendo Game Boy (Color) emulator
brew "gearsystem" # Sega Master System / Game Gear / SG-1000 emulator
brew "generate-json-scheme" # Generate a JSON Schema from Sample JSON
brew "getmail" # Extensible mail retrieval system with POP3, IMAP4, SSL support
brew "ghi" # Work on GitHub issues on the command-line
brew "gist" # Command-line utility for uploading Gists
brew "gistit" # Command-line utility for creating Gists
brew "git"
brew "git-appraise" # Distributed code review system for Git repos
brew "git-delta" # Syntax-highlighting pager for git
brew "git-extras" # Small git utilities
brew "git-flow"
brew "git-fresh" # Utility to keep git repos fresh
brew "git-game" # Game for git to guess who made which commit
brew "git-lfs"
brew "git-now" # Light, temporary commits for git
brew "git-octopus" # The continuous merge workflow
brew "git-open" # Open GitHub webpages from a terminal
brew "git-secrets" # Prevents you from committing sensitive information to a git repo
brew "git-standup" # Git extension to generate reports for standup meetings
brew "git-utils" # Various Git helper utilities
brew "giter8" # Generate files and directories from templates in a git repo
brew "github-markdown-toc" # Easy TOC creation for GitHub README.md (in go)
brew "gitmoji" # Emoji guide for your commit messages
brew "gitversion" # Easy semantic versioning for projects using Git
brew "glances" # Alternative to top/htop
brew "glide" # Simplified Go project management, dependency management, and vendoring
brew "globe" # Prints ASCII graphic of currently-lit side of the Earth
brew "gnu-complexity" # Measures complexity of C source
brew "go-jira" # Simple jira command-line client in Go
brew "goad" # AWS Lambda powered, highly distributed, load testing tool built in Go
brew "gomplate" # Command-line Golang template processor
brew "goofys" # Filey-System interface to Amazon S3
brew "googler" # Google Search and News from the command-line
brew "gotags" # Tag generator for Go, compatible with ctags
brew "gotags" # Go cross compile tool
brew "grafana" # Gorgeous metric visualizations and dashboards for timeseries databases
brew "graph-tool" # Efficient network analysis for Python 3
brew "greed" # Game of consumption
brew "grip" # GitHub Markdown previewer
brew "gron" # Make JSON greppable
brew "hdf5" # File format designed to store large amounts of data
brew "help2man" # Automatically generate simple man pages
brew "hugo"
brew "kibana"
brew "neovim"
brew "node"
brew "nvm"
brew "zsh"
brew "zsh-completions"
brew "hivemind" # The mind to rule processes of your development environment
brew "hledger" # Command-line accounting tool
brew "hub" # Add GitHub support to git on the command-line
brew "hubflow" # GitFlow for GitHub
brew "hyperfine" # Command-line benchmarking tool
brew "hyperscan" # High-performance regular expression matching library
brew "icdiff" # Improved colored diff
brew "ii" # Minimalist IRC client
brew "imagemagick"
brew "imessage-ruby" # Command-line tool to send iMessage"
brew "immortal" # OS agnostic (*nix) cross-platform supervisor
brew "iniparser" # Library for parsing ini files
brew "Program for recording a UNIX terminal session" # ipbt
